app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "bob2"]]
---
    def create
        username = params[:username]
        password = params[:password]
        user = User.find_by({username: username})